<a href="https://colab.research.google.com/github/yusufbaykal/Veri-bilimi-kutuphaneleri/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [4]:
#Pandas kütüphanesinin indirimi ve çarğırılması
!pip install pandas
import pandas as pd
import seaborn as sns

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
# Pandas serisi oluşturma
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
seri = pd.Series([1,2,3,4,5])

In [ ]:
# Serinin veri tipine bakıyoruz.
print(type(seri))

<class 'pandas.core.series.Series'>

In [ ]:
# Dizideki öğe sayısı
seri.size

5

In [ ]:
# Dizinin boyut sayısı
seri.ndim

1

In [ ]:
#Seri deki değerlerin toplamı
seri.sum()

15

In [ ]:
# en büyük değer
seri.max()

5

In [ ]:
#ortalama değeri
seri.mean()

3.0

In [ ]:
#median değeri
seri.median()

3.0

In [ ]:
seri.values

array([1, 2, 3, 4, 5])

In [ ]:
#Serini ilk 3 değeri
seri.head(3)

0    1
1    2
2    3
dtype: int64

In [ ]:
#Serini son 2 değeri
seri.tail(2)

3    4
4    5
dtype: int64

In [ ]:
pd.Series([99,22,321,94,5], index = [1,2,478,88,33])

1       99
2       22
478    321
88      94
33       5
dtype: int64

In [ ]:
sozluk = pd.Series({"reg":10,"log:":11,"cart":12})

In [ ]:
sozluk

reg     10
log:    11
cart    12
dtype: int64

In [ ]:
seri = pd.Series(sozluk)

In [ ]:
seri

reg     10
log:    11
cart    12
dtype: int64

In [ ]:
seri["reg"]

10

In [ ]:
# Numpy kütüphanesini dahil ediyoruz ve Bir pandas serisi oluşturuyoruz.
import numpy as np
a = pd.array([1,2,3,4,5])
seri = pd.Series(a)

In [ ]:
seri

0    1
1    2
2    3
3    4
4    5
dtype: Int64

In [ ]:
#0. indexten 3'e kadar getirme işlemi.
seri[0:3]

0    1
1    2
2    3
dtype: Int64

In [ ]:
seri = pd.Series([121,200,150,99], 
                 index = ["reg","log","rf","sin"])

In [ ]:
#Seri indexleri
seri.index

Index(['reg', 'log', 'rf', 'sin'], dtype='object')

In [ ]:
#dizi için takma adı, serinin etiketlerini döndürür.
seri.keys

<bound method Series.keys of reg    121
log    200
rf     150
sin     99
dtype: int64>

In [ ]:
# Dizinin değelerini döndürür.
list(seri.items())

[('reg', 121), ('log', 200), ('rf', 150), ('sin', 99)]

In [ ]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [ ]:
#Seri içerisinde 'reg' bulunuyormu? (Bulunuyorsa True,yoksa False değerini döndürür)
"reg" in seri

True

In [ ]:
seri[["rf","reg"]]

rf     150
reg    121
dtype: int64

In [ ]:
#Reg'in değerini değiştirmek
seri ["reg"] = 130

In [ ]:
seri

reg    130
log    200
rf     150
sin     99
dtype: int64

In [ ]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size = (10,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    20    10    18
1    26     9    21
2    15     3    20
3    27    24    16
4    19     6     8
5    25     7    17
6    29    17     9
7    26    10    27
8    28    17     9
9     2    19    18

In [ ]:
#Data içerisindeki var2 kolonun çıkarılma işlemi (var2 değerini temelli çıkarmaz)
df.drop('var2',axis=1)

   var1  var3
0    20    18
1    26    21
2    15    20
3    27    16
4    19     8
5    25    17
6    29     9
7    26    27
8    28     9
9     2    18

In [ ]:
df1 = df

In [ ]:
##Data içerisindeki var2 kolonun tamamen çıkarılması için sonuna inplace=True ekliyoruz.
df1.drop("var2",axis=1,inplace=True)

In [ ]:
df.var1.mean()

21.7

In [ ]:
#Datanın dağılımlarını inceliyoruz, kodun sonuna .T eklediğimiz taktirde daha iyi görünüş elde ederiz
df.describe().T

      count  mean       std  min    25%   50%    75%   max
var1   10.0  21.7  8.246885  2.0  19.25  25.5  26.75  29.0
var2   10.0  12.2  6.679987  3.0   7.50  10.0  17.00  24.0
var3   10.0  16.3  6.074537  8.0  10.75  17.5  19.50  27.0

In [ ]:
#0-3 arası değelerine erişim
df.loc[0:3]

   var1  var2  var3
0    18     3     5
1    20    23     3
2    25    27    15
3    13    20     6

In [ ]:
# Satır ve sutünlar grubuna erişim 
df.iloc[0:3]

   var1  var2  var3
0    18     3     5
1    20    23     3
2    25    27    15

In [ ]:
df.iloc[0,0]

18

In [ ]:
df.iloc[:3,:2]

   var1  var2
0    18     3
1    20    23
2    25    27

In [ ]:
df.loc[0:3,"var3"] # Böyle alamazsın

0     5
1     3
2    15
3     6
Name: var3, dtype: int64

In [ ]:
df.iloc[0:3,"var3"] # Böyle Hata alırsın.

In [ ]:
#Değerler arası grup indexine erişim
df.iloc[0:3]["var3"]

0     5
1     3
2    15
Name: var3, dtype: int64

In [ ]:
df["var1"][0:3]

0    18
1    20
2    25
Name: var1, dtype: int64

In [ ]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
0    18     3
1    20    23
2    25    27
4    16     9
6    22     8

In [5]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])

In [ ]:
df.var1

0    18
1    10
2    29
3     9
4    15
5     5
6    10
7    12
8     7
9    18
Name: var1, dtype: int64

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
# var1 değerleri
df["var1"]

0    23
1    12
2    23
3    10
4    28
5     9
6    29
7    25
8    25
9    14
Name: var1, dtype: int64

In [6]:
#Min,median ve max değerlerinin grup halinde yazdırılması
df.groupby("var2").aggregate([min, np.median, max])

     var1            var3
      min median max  min median max
var2
11     13     13  13    9      9   9
12     22     22  22    9      9   9
14      9      9   9    3      3   3
19      1      1   1   28     28  28
20     22     22  22   10     10  10
25      2      2   2    7      7   7
27      5     14  29   13     16  28
28     21     21  21    3      3   3

In [7]:
df.groupby("var1").aggregate({"var2": 'min', "var3": 'max'})

      var2  var3
var1
1       19    28
2       25     7
5       27    28
9       14     3
13      11     9
14      27    16
21      28     3
22      12    10
29      27    13

In [8]:

#Titanic datasının yüklenmesi
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
#Ortalamalara bakılması
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [ ]:
#Cinsiyete göre bireylerin hangi sınıfta yer aldığının kontorlü
titanic.groupby(["sex","class"])[["survived"]].aggregate("count").unstack()

       survived
class     First Second Third
sex
female       94     76   144
male        122    108   347

In [ ]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [ ]:
titanic.pivot_table("survived",index = "sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [9]:
#Yaşları 18-90 arası kişileri sınıflandırmasını yapmak
age = pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [10]:
#Yaşların sınıflandırılmasının cinsiyet faktörüne göre ve First,Second,Third gibi değişkenler arasındaki dağılımını göstermek.
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663